Revit 2024 API
ViewsExportedByContextEventArgs.GetViewIds Method
 Gets the views that were exported by CustomExporter.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public IList<ElementId> GetViewIds()
Visual Basic
Public Function GetViewIds As IList(Of ElementId)
Visual C++
public:
IList<ElementId^>^ GetViewIds()
Return Value
 The views that were exported by CustomExporter.
See Also
ViewsExportedByContextEventArgs Class
Autodesk.Revit.DB.Events Namespace